---
type: Color
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# Color

`Autodesk.Revit.DB.Color` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | Color | — | `public Color ( byte red , byte green , byte blue )` |
| Property | Blue | — | `public byte Blue { get ; set ; }` |
| Property | Green | — | `public byte Green { get ; set ; }` |
| Property | InvalidColorValue | 2014 | `public static Color InvalidColorValue { get ; }` |
| Property | IsValid | 2012 | `public bool IsValid { get ; }` |
| Property | Red | — | `public byte Red { get ; set ; }` |